dependencies/OpenFOAM/modules/adios/tutorials/incompressible/icoFoam/cavity/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
# -----------------------------------------------------------------------------

runApplication blockMesh
runApplication decomposePar -force

runParallel icoFoam

# -----------------------------------------------------------------------------
